using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BD_LAVR_KP.GUI.GUI_Classes
{
    public enum FormAnimateEffects
    {
        СКОЛЬЖЕНИЕ_СПРАВА_НАЛЕВО = 0x00040000 | 0x00000002,
        СКОЛЬЖЕНИЕ_СЛЕВА_НАПРАВО = 0x00040000 | 0x00000001,
        СКОЛЬЖЕНИЕ_СВЕРХУ_ВНИЗ = 0x00040000 | 0x00000004,
        СКОЛЬЖЕНИЕ_СНИЗУ_ВВЕРХ = 0x00040000 | 0x00000002,
        СКОЛЬЖЕНИЕ_CBEPXY_HAПPABO = 010040000 | 0x00000004 | 0x00000001,
        СКОЛЬЖЕНИЕ_СНИЗУ_НАПРАВО = 0x00040000 | 0x00000008 | 0x00000601,
        СКОЛЬЖЕНИЕ_СВЕРХУ_НАЛЕВО = 0x00040000 | 0x00000004 | 0x00000002,
        СКОЛЬЖЕНИЕ_СНИЗУ_НАЛЕВО = 0x00040000 | 0x00000008 | 0x00000002,
        РАСКРЫТИЕ_СКРЫТИЕ = 0x00000010,
        ПОЯВЛЕНИЕ_ЗАТУХАНИЕ = 0x00080000

    }
}
